ome-publish.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Oh My Emacs Publish</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="Oh My Emacs Publish"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-12-30T17:03+0800"/>
<meta name="author" content=""/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Oh My Emacs Publish</h1>

<p>This is part of the <a href="https://github.com/xiaohanyu/oh-my-emacs">oh-my-emacs</a>.
</p>
<p>
This file is used to publish the oh-my-emacs documentation to <code>.html</code>
in the <code>doc/</code> directory.
</p>
<p>
This code defines the <code>ome-project</code> which is used to publish
the documentation for the oh-my-emacs to html.
</p>



<pre class="example">(unless (boundp 'org-publish-project-alist)
  (setq org-publish-project-alist nil))

(let* ((this-dir (file-name-directory (or load-file-name buffer-file-name))))
  ;; define the org-publish-project for the oh-my-emacs
  (setq org-publish-project-alist
        `(("oh-my-emacs"
           :components ("ome-index" "ome-core" "ome-modules")
           :base-extension "org")
          ("ome-index"
           :base-directory ,this-dir
           :publishing-directory ,(expand-file-name "doc" this-dir)
           :index-filename "ome.org"
           :html-postamble nil)
          ("ome-core"
           :base-directory ,(expand-file-name "core" this-dir)
           :publishing-directory ,(expand-file-name "doc/core" this-dir)
           :index-filename "ome.org"
           :html-postamble nil)
          ("ome-modules"
           :base-directory ,(expand-file-name "modules" this-dir)
           :publishing-directory ,(expand-file-name "doc/modules" this-dir)
           :index-filename "ome.org"
           :html-postamble nil)))
  ;; publish the oh-my-emacs
  (org-publish-project "oh-my-emacs" 'force))
</pre>

</div>

</body>
</html>
